# AssignedFlow Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..AssignedFlow Property
Connector Class See Also
---
The assigned flow of the connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double AssignedFlow { get; set; }
```

Visual Basic
---
```text
Public Property AssignedFlow As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double AssignedFlow {
	double get ();
	void set (double value);
}
```

# Remarks
Assigned flow may be assigned for connectors of some family instances. In order to set this property, it must be mapped to a writable instance parameter in the family definition.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the connector's domain is not DomainPiping or DomainHvac. Thrown when the connector is not in a family instance. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when set an invalid value. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown on failure to get or set assigned flow. |

# See Also
Connector Class
Autodesk.Revit.DB Namespace